In [1]:

import pandas as pd

In [33]:
data = [["yasir",20,'A'],
        ["yasir1",21,'A'],
        ["yasir2",24,'A'],
       ["yasir1",25,'A'],
       ["yasir1",22,'A']]

In [34]:
print(data)

[['yasir', 20, 'A'], ['yasir1', 21, 'A'], ['yasir2', 24, 'A'], ['yasir1', 25, 'A'], ['yasir1', 22, 'A']]

In [35]:
df = pd.DataFrame(data,columns=["name",'age','grade'],index = ['std1','std2','std3','std4','std5'])

In [36]:
df

        name  age grade
std1   yasir   20     A
std2  yasir1   21     A
std3  yasir2   24     A
std4  yasir1   25     A
std5  yasir1   22     A

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, std1 to std5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   grade   5 non-null      object
dtypes: int64(1), object(2)
memory usage: 160.0+ bytes

In [40]:
df['year_birth'] = 2025 - df['age']

In [44]:
df['age']['std3'] = 26

C:\Users\memon\AppData\Local\Temp\ipykernel_6052\2125857607.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['age']['std3'] = 26
C:\Users\memon\AppData\Local\Temp\ipykernel_6052\2125857607.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['age']['std3'] = 26

In [45]:
df

        name  age grade  year_birth
std1   yasir   20     A        2005
std2  yasir1   21     A        2004
std3  yasir2   26     A        2001
std4  yasir1   25     A        2000
std5  yasir1   22     A        2003

In [2]:
calories = pd.read_csv('calories.csv')

In [3]:
calories.head(10)

   Duration  Pulse  Maxpulse  Calories
0      60.0    110       130     409.1
1      60.0    117       145     479.0
2      60.0    103       135     340.0
3      45.0    109       175     282.4
4      45.0    117       148     406.0
5      60.0    102       127     300.0
6      60.0    110       136     374.0
7       NaN    104       134     253.3
8      30.0    109       133     195.1
9      60.0     98       124     269.0

In [4]:
calories.tail()

     Duration  Pulse  Maxpulse  Calories
164      60.0    105       140     290.8
165      60.0    110       145     300.0
166      60.0    115       145     310.2
167      75.0    120       150     320.4
168      75.0    125       150     330.4

# Slicing

In [5]:
calories[5:10][['Maxpulse','Calories']]
calories.iloc[5:10,1:3]
calories.loc[5:10][['Maxpulse','Calories']]

    Maxpulse  Calories
5        127     300.0
6        136     374.0
7        134     253.3
8        133     195.1
9        124     269.0
10       147     329.3

# conditional slicing

In [6]:
data = [['Ahmed1','AIDS',80,'A'],
       ['Ahmed2','AIDS',85,'A'],
       ['Ahmed3','AIDS',75,'B'],
       ['Ahmed4','AIDS',72,'B'],
       ['Ahmed5','AIDS',60,'C']]
std_data = pd.DataFrame(data,columns = ['Name','Class','Marks','Grade'])

In [7]:
std_data

     Name Class  Marks Grade
0  Ahmed1  AIDS     80     A
1  Ahmed2  AIDS     85     A
2  Ahmed3  AIDS     75     B
3  Ahmed4  AIDS     72     B
4  Ahmed5  AIDS     60     C

In [8]:
std_data[std_data.Grade == 'A']

     Name Class  Marks Grade
0  Ahmed1  AIDS     80     A
1  Ahmed2  AIDS     85     A

In [9]:
std_data[std_data.Marks > 70][std_data.Grade == 'A']

C:\Users\memon\AppData\Local\Temp\ipykernel_17736\2803732428.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  std_data[std_data.Marks > 70][std_data.Grade == 'A']

     Name Class  Marks Grade
0  Ahmed1  AIDS     80     A
1  Ahmed2  AIDS     85     A

In [19]:
data = [{'Name':'Yasir', 'Age': 20, 'Marks':95, 'Grade':'A+'},
        {'Name':'Yasir', 'Age': 20, 'Marks':80, 'Grade':'A'},
        {'Name':'Yasir', 'Age': 20, 'Marks':75, 'Grade':'B+'},
        {'Name':'Yasir', 'Age': 20, 'Marks':75, 'Grade':'B+'},
        {'Name':'Yasir', 'Age': 20, 'Marks':65, 'Grade':'C+'},
        {'Name':'Yasir', 'Age': 20, 'Marks':95, 'Grade':'A+'},
        {'Name':'Yasir', 'Age': 20, 'Marks':65, 'Grade':'C+'},
       ]
std_data = pd.DataFrame(data)

In [20]:
std_data

    Name  Age  Marks Grade
0  Yasir   20     95    A+
1  Yasir   20     80     A
2  Yasir   20     75    B+
3  Yasir   20     75    B+
4  Yasir   20     65    C+
5  Yasir   20     95    A+
6  Yasir   20     65    C+

In [21]:
std_data.shape

(7, 4)

In [13]:
std_data.dtypes

Name     object
Age       int64
Marks     int64
Grade    object
dtype: object

In [14]:
calories.describe()

         Duration       Pulse    Maxpulse     Calories
count  168.000000  169.000000  169.000000   164.000000
mean    63.958333  107.461538  134.047337   375.790244
std     42.401185   14.510259   16.450434   266.379919
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

In [22]:
std_data.Grade.value_counts()

Grade
A+    2
B+    2
C+    2
A     1
Name: count, dtype: int64

In [24]:
calories.count()

Duration    168
Pulse       169
Maxpulse    169
Calories    164
dtype: int64

In [31]:
calories.isnull().sum()

Duration    1
Pulse       0
Maxpulse    0
Calories    5
dtype: int64

In [29]:
std_data.Marks.sum()

np.int64(550)

In [32]:
std_data['Total'] = 100

In [33]:
std_data

    Name  Age  Marks Grade  Total
0  Yasir   20     95    A+    100
1  Yasir   20     80     A    100
2  Yasir   20     75    B+    100
3  Yasir   20     75    B+    100
4  Yasir   20     65    C+    100
5  Yasir   20     95    A+    100
6  Yasir   20     65    C+    100

In [34]:
std_data['Per'] = (std_data.Marks / std_data.Total) * 100

In [35]:
std_data

    Name  Age  Marks Grade  Total   Per
0  Yasir   20     95    A+    100  95.0
1  Yasir   20     80     A    100  80.0
2  Yasir   20     75    B+    100  75.0
3  Yasir   20     75    B+    100  75.0
4  Yasir   20     65    C+    100  65.0
5  Yasir   20     95    A+    100  95.0
6  Yasir   20     65    C+    100  65.0

In [60]:
student = pd.read_csv('student_marks.csv')

In [61]:
student

           roll_no                  name  quiz_1  quiz_2  quiz_3  final_exam
0    SMIT/DSAI/001         Thomas Mcneil     6.0     1.0     6.0         6.0
1    SMIT/DSAI/002       Brian Davis Jr.     3.0     2.0     7.0         3.0
2    SMIT/DSAI/003  Christopher Thompson    10.0     8.0     2.0         7.0
3    SMIT/DSAI/004          Thomas Ortiz     7.0     6.0     5.0        19.0
4    SMIT/DSAI/005      Benjamin Aguirre     4.0     3.0     0.0        28.0
..             ...                   ...     ...     ...     ...         ...
495  SMIT/DSAI/496           Rita Torres     9.0     9.0     7.0         NaN
496  SMIT/DSAI/497           Paul Thomas     7.0     8.0     7.0         NaN
497  SMIT/DSAI/498           Jacob Simon     9.0     1.0    10.0        10.0
498  SMIT/DSAI/499        Kimberly Ayers     9.0     7.0     1.0         3.0
499  SMIT/DSAI/500           Alvin Brown     9.0     7.0     8.0         NaN

[500 rows x 6 columns]

In [62]:
student.dtypes

roll_no        object
name           object
quiz_1        float64
quiz_2        float64
quiz_3        float64
final_exam    float64
dtype: object

In [63]:
student['obtain'] = student.iloc[:, 2:].sum(axis = 1)

In [64]:
student

,roll_no,name,quiz_1,quiz_2,quiz_3,final_exam,obtain
0,SMIT/DSAI/001,Thomas Mcneil,6.0,1.0,6.0,6.0,19.0
1,SMIT/DSAI/002,Brian Davis Jr.,3.0,2.0,7.0,3.0,15.0
2,SMIT/DSAI/003,Christopher Thompson,10.0,8.0,2.0,7.0,27.0
3,SMIT/DSAI/004,Thomas Ortiz,7.0,6.0,5.0,19.0,37.0
4,SMIT/DSAI/005,Benjamin Aguirre,4.0,3.0,0.0,28.0,35.0
...,...,...,...,...,...,...,...
495,SMIT/DSAI/496,Rita Torres,9.0,9.0,7.0,NaN,25.0
496,SMIT/DSAI/497,Paul Thomas,7.0,8.0,7.0,NaN,22.0
497,SMIT/DSAI/498,Jacob Simon,9.0,1.0,10.0,10.0,30.0
498,SMIT/DSAI/499,Kimberly Ayers,9.0,7.0,1.0,3.0,20.0
499,SMIT/DSAI/500,Alvin Brown,9.0,7.0,8.0,NaN,24.0

In [65]:
student['total'] = 100

In [66]:
student['per'] = (student.obtain / student.total) * 100

In [67]:
student

,roll_no,name,quiz_1,quiz_2,quiz_3,final_exam,obtain,total,per
0,SMIT/DSAI/001,Thomas Mcneil,6.0,1.0,6.0,6.0,19.0,100,19.0
1,SMIT/DSAI/002,Brian Davis Jr.,3.0,2.0,7.0,3.0,15.0,100,15.0
2,SMIT/DSAI/003,Christopher Thompson,10.0,8.0,2.0,7.0,27.0,100,27.0
3,SMIT/DSAI/004,Thomas Ortiz,7.0,6.0,5.0,19.0,37.0,100,37.0
4,SMIT/DSAI/005,Benjamin Aguirre,4.0,3.0,0.0,28.0,35.0,100,35.0
...,...,...,...,...,...,...,...,...,...
495,SMIT/DSAI/496,Rita Torres,9.0,9.0,7.0,NaN,25.0,100,25.0
496,SMIT/DSAI/497,Paul Thomas,7.0,8.0,7.0,NaN,22.0,100,22.0
497,SMIT/DSAI/498,Jacob Simon,9.0,1.0,10.0,10.0,30.0,100,30.0
498,SMIT/DSAI/499,Kimberly Ayers,9.0,7.0,1.0,3.0,20.0,100,20.0
499,SMIT/DSAI/500,Alvin Brown,9.0,7.0,8.0,NaN,24.0,100,24.0

In [68]:
def grades_func(x):
    if x >= 80:
        return 'A'
    elif x >= 70:
        return 'B'
    elif x >= 60:
        return 'C'
    else:
        return 'F'

In [72]:
grades = []
for p in student['per']:
    grades.append(grades_func(p))

In [74]:
student['grades'] = grades

In [75]:
student

,roll_no,name,quiz_1,quiz_2,quiz_3,final_exam,obtain,total,per,grades
0,SMIT/DSAI/001,Thomas Mcneil,6.0,1.0,6.0,6.0,19.0,100,19.0,F
1,SMIT/DSAI/002,Brian Davis Jr.,3.0,2.0,7.0,3.0,15.0,100,15.0,F
2,SMIT/DSAI/003,Christopher Thompson,10.0,8.0,2.0,7.0,27.0,100,27.0,F
3,SMIT/DSAI/004,Thomas Ortiz,7.0,6.0,5.0,19.0,37.0,100,37.0,F
4,SMIT/DSAI/005,Benjamin Aguirre,4.0,3.0,0.0,28.0,35.0,100,35.0,F
...,...,...,...,...,...,...,...,...,...,...
495,SMIT/DSAI/496,Rita Torres,9.0,9.0,7.0,NaN,25.0,100,25.0,F
496,SMIT/DSAI/497,Paul Thomas,7.0,8.0,7.0,NaN,22.0,100,22.0,F
497,SMIT/DSAI/498,Jacob Simon,9.0,1.0,10.0,10.0,30.0,100,30.0,F
498,SMIT/DSAI/499,Kimberly Ayers,9.0,7.0,1.0,3.0,20.0,100,20.0,F
499,SMIT/DSAI/500,Alvin Brown,9.0,7.0,8.0,NaN,24.0,100,24.0,F

In [1]:
import pandas as pd

In [56]:
student_data = pd.read_csv('students_five_classes.csv', na_values=['AB'])

In [57]:
student_data

           roll_no           name  exam1  exam2  final_exam
0    SMIT/DSAI/001    David Iqbal   20.0   16.0        35.0
1    SMIT/DSAI/002    Ahmed Ahmed   13.0    7.0         NaN
2    SMIT/DSAI/003     John Zahid   13.0   24.0        47.0
3    SMIT/DSAI/004    David Brown    0.0   15.0        24.0
4    SMIT/DSAI/005    Fatima Khan   20.0    8.0         6.0
..             ...            ...    ...    ...         ...
495   SMIT/MAW/096     Sara Zahid    8.0   10.0        45.0
496   SMIT/MAW/097     Ayesha Ali   14.0    3.0        31.0
497   SMIT/MAW/098  Michael Brown    2.0   20.0        50.0
498   SMIT/MAW/099     Sara Malik   24.0    6.0        16.0
499   SMIT/MAW/100       Noor Ali    9.0   11.0        44.0

[500 rows x 5 columns]

# How to drop and fill NaN values

In [58]:
# student_data.dropna(inplace = True)
student_data.fillna(0, inplace = True)

In [59]:
student_data

           roll_no           name  exam1  exam2  final_exam
0    SMIT/DSAI/001    David Iqbal   20.0   16.0        35.0
1    SMIT/DSAI/002    Ahmed Ahmed   13.0    7.0         0.0
2    SMIT/DSAI/003     John Zahid   13.0   24.0        47.0
3    SMIT/DSAI/004    David Brown    0.0   15.0        24.0
4    SMIT/DSAI/005    Fatima Khan   20.0    8.0         6.0
..             ...            ...    ...    ...         ...
495   SMIT/MAW/096     Sara Zahid    8.0   10.0        45.0
496   SMIT/MAW/097     Ayesha Ali   14.0    3.0        31.0
497   SMIT/MAW/098  Michael Brown    2.0   20.0        50.0
498   SMIT/MAW/099     Sara Malik   24.0    6.0        16.0
499   SMIT/MAW/100       Noor Ali    9.0   11.0        44.0

[500 rows x 5 columns]

In [60]:
student_data.dtypes

roll_no        object
name           object
exam1         float64
exam2         float64
final_exam    float64
dtype: object

In [105]:
student_data = student_data.astype({'exam1':int,
                    'exam2': float,
                    'final_exam': int})

In [106]:
student_data.dtypes

roll_no          object
name             object
exam1             int64
exam2           float64
final_exam        int64
obtain_marks      int64
total_marks       int64
percenage       float64
grades           object
classes          object
dtype: object

In [64]:
student_data['obtain_marks'] = student_data.iloc[:, 2:].sum(axis = 1)

In [66]:
student_data['total_marks'] = 100

In [68]:
student_data['percenage'] = (student_data['obtain_marks']/student_data['total_marks'])*100

In [69]:
student_data

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percenage
0,SMIT/DSAI/001,David Iqbal,20,16,35,71,100,71.0
1,SMIT/DSAI/002,Ahmed Ahmed,13,7,0,20,100,20.0
2,SMIT/DSAI/003,John Zahid,13,24,47,84,100,84.0
3,SMIT/DSAI/004,David Brown,0,15,24,39,100,39.0
4,SMIT/DSAI/005,Fatima Khan,20,8,6,34,100,34.0
...,...,...,...,...,...,...,...,...
495,SMIT/MAW/096,Sara Zahid,8,10,45,63,100,63.0
496,SMIT/MAW/097,Ayesha Ali,14,3,31,48,100,48.0
497,SMIT/MAW/098,Michael Brown,2,20,50,72,100,72.0
498,SMIT/MAW/099,Sara Malik,24,6,16,46,100,46.0
499,SMIT/MAW/100,Noor Ali,9,11,44,64,100,64.0

In [70]:
def grades_func(x):
    if x >= 80:
        return 'A'
    elif x >= 70:
        return 'B'
    elif x >= 60:
        return 'C'
    else:
        return 'F'

In [73]:
student_data['grades'] = student_data['percenage'].apply(grades_func)

In [81]:
student_data['classes'] = student_data['roll_no'].str.split('/').str[1]

In [83]:
student_data.classes.unique()

array(['DSAI', 'DM', 'UIUX', 'GD', 'MAW'], dtype=object)

In [84]:
students_DSAI = student_data[student_data['classes'] == 'DSAI']
students_DM = student_data[student_data['classes'] == 'DM']
students_UIUX = student_data[student_data['classes'] == 'UIUX']
students_GD = student_data[student_data['classes'] == 'GD']
students_MAW = student_data[student_data['classes'] == 'MAW']

In [100]:
students_DM.loc[students_DM['percenage'].idxmax()]

roll_no         SMIT/DM/009
name             Sara Iqbal
exam1                    19
exam2                    17
final_exam               49
obtain_marks             85
total_marks             100
percenage              85.0
grades                    A
classes                  DM
Name: 108, dtype: object

In [101]:
students_DM.loc[students_DM['percenage'].idxmin()]

roll_no         SMIT/DM/055
name             Hina Brown
exam1                     3
exam2                     6
final_exam                1
obtain_marks             10
total_marks             100
percenage              10.0
grades                    F
classes                  DM
Name: 154, dtype: object

In [102]:
print(students_DM['percenage'].mean())

51.86